{ 
  "heading" : {
  	"en" : "Hi, I'm Srinivas Rao,"},

  "lead" : { 
  	"en" : "a senior undergraduate student at Indian Institute of Technology Kanpur."},

  "about" : {
  	"en" : "At my university I am a part of the Visual Computing Lab supervised by <a href='https://www.cse.iitk.ac.in/users/vinaypn/' style='color: rgb(0,0,225)'>Prof. Vinay Namboodiri</a>. 
    My research interests are Computer Vision, Deep Learning and Computer Graphics (VR/AR). 
    <br><br>
    Besides being an student, I also currently work part-time as a research consultant for <a href='https://fyusion.com/' style='color: rgb(0,0,225)'>Fyusion Inc</a>.  (a 3D computer vision and machine learning company based in San Francisco) where I solve computer vision related problems using deep learning. A recent Techcrunch post about the company can be found <a style='color: rgb(0,0,225)' href='https://techcrunch.com/2017/12/18/fyusion-is-bringing-3d-vision-technologies-to-a-device-near-you/'>here</a>.
    <br><br>
    Last summer I was a research intern at <a href='https://fyusion.com/' style='color: rgb(0,0,225)'>Fyusion Inc</a>, San Francisco and the summer before that, I was a research intern at the wonderful <a href='https://team.inria.fr/graphdeco/team-members/' style='color: rgb(0,0,225)'>Graphdeco</a> team at Inria Sophia Antipolis, France.
    <br><br>
    Besides research, I also like to tinker with various new sensors like <a href='https://en.wikipedia.org/wiki/Tango_(platform)' style='color: rgb(0,0,225)'>Google Tango</a>,
    <a href='https://www.oculus.com/rift/' style='color: rgb(0,0,225)'>Oculus Rift</a>, <a href='https://www.leapmotion.com/' style='color: rgb(0,0,225)'>Leap Motion</a> in my free time. 
    Sometimes, I try to post about some of these experiments on <a style='color: rgb(0,0,225)' href='https://www.youtube.com/channel/UCn_clMMllo53u6S8ZjF56oQ'>Youtube</a>. I like open-source philosophy and hence I also try to open-source some of my experiments on github."
  },

  "news" : {
    "en" : "<strong>News</strong>
    <br>
    <strong>-</strong> I will be attending Siggraph Asia 2017, Bangkok, Thailand.
    <br>
    <strong>-</strong> I will be presenting my paper at ISMAR 2017, Nantes, France.
    <br>
    <strong>-</strong> I will be interning at Fyusion Inc., San Francisco for the summer of 2017.
    <br>
    <strong>-</strong> I will be interning at Graphdeco, Inria Sophia Antipolis for the summer of 2016.
    "
  }
}



